Web.Application.Architectures/blog/app/views/comments/_comment.html.erb

INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Added using Ajax"], ["created_at", "2014-09-16 09:45:01.344316"], ["post_id", 1], ["updated_at", "2014-09-16 09:45:01.344316"]]
---
  <p>
    <strong>Posted <%= time_ago_in_words(comment.created_at) %> ago</strong><br />