Web.Application.Architectures/blog/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Life is great!"], ["created_at", "2014-08-24 03:07:11.432620"], ["title", "My First Post"], ["updated_at", "2014-08-24 03:07:11.432620"]]